/// 공연 정보 페이지
/// 섹션은 2개로 나눠지고, 앱바는 backOnly를 사용한다. >> 이때 appbar는 해당 페이지가 비치도록 두명을 유지하고 앱바 버튼의 색상은 흰색을 유지한다.
/// - A. 직사각형 약 600 높이를 가짐. 검정 80% 투명도(모든 요소 색상이 다크모드일때도 변함없음.)를 가진 색상의 배경을 사진위에 덧씌워서 그 위에, 공연 포스터와 제목, 날짜, 디데이를 표시하는 부분
/// - B. 상세 정보들을 표현하기 위해 탭(core/widget/app_tap_bar.dart)으로 나눠둔 정보 구간
/// - 1. 공연 정보 : 공연 팀, 공연 소개, 공연 시간, 공연 장소, 티켓 정보, 호스트 정보를 표시하는 공간
/// - - 장소의 경우, [일정] 관련 상세 페이지 처럼 지도 보기 toggle다운 버튼을 누르면 아래 지도가 표시되고 장소를 상세 조회하는 페이지까지 연결되는 로직은 동일하게 가지고 간다.
/// - - 호스트의 경우, 이름 + 문의하기 버튼(underline이 있는 주황색 버튼)이 있고, 버튼을 눌면 공연 호스트 정보가 연락처 / 링크에 따라서 다르게 보이도록 된다.
/// - 2. 상세 정보 : 이미지들, 상세 정보가 들어가는 공간
